/*
Пакет cmdexecutor реализует функции для выполнения команд пользователя.

Переменные вида add*Exec содержат функцию для добавления соответствующих данных.

Переменные вида upd*Exec содержат функцию для обновления соответствующих данных.

Переменные вида get*Exec содержат функцию для получения соответствующих данных.

Переменные вида forceAdd*ServerExec содержат функцию для обновления соответствующих данных на сервере.

Переменные вида get*ServerExec содержат функцию для получения соответствующих данных с сервера.

Переменная regExec содержит функцию для регистрации пользователя.

Переменная authExec содержит функцию для аутентификации пользователя.

Переменная exitExec содержит функцию для выхода из приложения.

Переменная verExec предоставляет пользователю информацию о версии и сборке приложения.

Файл tools содержит функции для конвертации между разными типами информации одного вида.
И функции для кодирования и декодирования хранимой информации.
*/
package cmdexecutor
